1.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:cms="http://www.huawei.com/bes/crminterface/cmservices"
        xmlns:crm="http://www.huawei.com/bes/crminterface/crmheader"
        xmlns:com="http://www.huawei.com/bes/crminterface/common">
    <soapenv:Header/>
    <soapenv:Body>
        <cms:querySubscriberReqMsg>
            <querySubReqHeader>
                <operatorInfo>
                    <crm:operatorId>714</crm:operatorId>
                </operatorInfo>
                <crm:version>1</crm:version>
                <crm:businessCode>QuerySubscriber</crm:businessCode>
                <crm:messageSeq>BHS_TEST_${=((int)(Math.random()*(9999999-1000000)+1000000))}</crm:messageSeq>
                <crm:queryBalanceOwnershipInfo>
                    <crm:beId>10101</crm:beId>
                    <crm:regionId>10101</crm:regionId>
                </crm:queryBalanceOwnershipInfo>
                <crm:accessSecurity>
                    <crm:loginSystemCode>714</crm:loginSystemCode>
                    <crm:password>kQwkaEwWU0gravIASYtwcf0XZq2BP0ahtPj/DKXeZyE=</crm:password>
                </crm:accessSecurity>
                <crm:operatorInfo>
                    <crm:operatorId>714</crm:operatorId>
                </crm:operatorInfo>
            </querySubReqHeader>
            <querySubscriberReq>
                <cms:queryObj>
                    <cms:subAccessCode>
                        <cms:primaryIdentity>9921905802</cms:primaryIdentity>
                    </cms:subAccessCode>
                </cms:queryObj>
                <cms:includeObj>
                    <cms:includeOfferFlag>N</cms:includeOfferFlag>
                    <cms:includeHistoryFlag>Y</cms:includeHistoryFlag>
                    <cms:includeProdFlag>N</cms:includeProdFlag>
                    <cms:includeContractFlag>N</cms:includeContractFlag>
                </cms:includeObj>
                <cms:pageQuery>
                    <com:pageSize>100</com:pageSize>
                    <com:startNum>1</com:startNum>
                    <com:totalNum>100</com:totalNum>
                </cms:pageQuery>
            </querySubscriberReq>
        </cms:querySubscriberReqMsg>
    </soapenv:Body>
</soapenv:Envelope>